app/controllers/silent_auctions_controller.rb

  def index
    @title = "Running Silent Auctions"
    if current_user.admin?
      @running_auctions = SilentAuction.running_auction_for_admin(get_region_config(current_user.region)["timezone"]).recent.includes(:bids)
---
SELECT "silent_auctions".* FROM "silent_auctions"

  def create
    @silent_auction = SilentAuction.new(params[:silent_auction])
    respond_to do |format|
      if @silent_auction.save
---
INSERT INTO "silent_auctions" ("created_at", "description", "open", "title", "updated_at") VALUES (?, ?, ?, ?, ?)